// https://programmers.co.kr/learn/courses/30/lessons/62048#

// 시간 복잡도
/**********************************************************************
유클리드 호제법의 시간복잡도 O(log N)
***********************************************************************/

// 개선점
/**********************************************************************
기울기를 이용한 풀이법도 해볼법 하다
***********************************************************************/

function GCD(m, n) {
  if (m % n == 0) return n;
  return GCD(n, m % n);
}

function solution(w, h) {
  return w * h - (w + h - GCD(w, h));
}

var w = 8;
var h = 12;
console.log(solution(w, h));
