// https://programmers.co.kr/learn/courses/30/lessons/70129

// 시간 복잡도
/**********************************************************************
n + n - 1 + n - 2 + n - 3 + ... + 1 번까지 할 수 있다고 한다면
n * (n + 1) = n^2 + n => O(n^2) ??
***********************************************************************/

// 개선점
/**********************************************************************
없을까요..
***********************************************************************/

function solution(s) {
  let count = 0;
  let zeros = 0;

  while (s !== "1") {
    zeros += s.match(/0/g) !== null ? s.match(/0/g).length : 0;
    s = s.replace(/0/g, "").length.toString(2);
    count++;
  }
  return [count, zeros];
}

var s = "110010101001";
console.log(solution(s));
